{
  "slots": [
    {
      "type": "filled",
      "content": [
        {
          "text": "Opening Session",
          "time": "10:00"
        }
      ]
    },
    {
      "file": "daniel.jpg",
      "name": "Daniel Ferrari",
      "role": "Lead ML Engineer",
      "bio": "Daniel Ferrari holds a Ph.D. in Data Mining and Machine Learning. Acting as a researcher, published a book and several articles in partnership with Computer Science and Biological labs. As a Software Engineer, he has contributed to the development of several applications for more than 15 years. Nowadays, he combines both experiences to act as a Machine Learning Engineer to develop pipelines from data extraction and manipulation to train and deploy models to production.",
      "github": "FerrariDG",
      "twitter": "FerrariDG77",
      "linkedin": "ferraridg",
      "title": " Asynchronous ML Inference with Celery and FastAPI",
      "abstract": "<p>This talk will present an architecture based on Celery and FastAPI for machine learning asynchronous inferences using. It will show how to take advantage of Celery's distributed task queues to scale asynchronous requests for any model. The services' concepts will be detailed, and a live demo will demonstrate how the system works.</p>",
      "time": "10:15"
    },
    {
      "file": "kristina.jpg",
      "name": "Kirstina Simakova",
      "role": "Independent Consultant",
      "bio": "Kristina is an independent IT consultant based in Norway. She is a Google Developer Expert for Android & Maps and has a keen interest in AR, ML and computer graphics. By day, she writes Android native code in Kotlin and by night, she blogs at creativetech.blog about AR.",
      "github": "Kristina-Simakova",
      "linkedin": "ksimakova",
      "twitter": "KristiSimakova",
      "title": "Mobile AR: overview and best practices",
      "abstract": "<p>The main goal of AR is to blur the lines between virtual and real. In the past few years, we have seen a lot of improvements in mobile AR and in particular ARCore SDK. This talk will guide you through the state of the technology for mobile AR, common mistakes and main challenges any developer will meet when working with AR on Android.</p>",
      "time": "10:45"
    },
    {
      "file": "jaime.jpg",
      "name": "Jaime Jorge",
      "role": "CEO @ Codacy",
      "bio": "CEO of Codacy, MsC in Software Engineering, Love programming languages, BJJ, Books..",
      "github": "jaimefjorge",
      "linkedin": "jaimejorge",
      "twitter": "jaimefjorge",
      "title": "The Evolution of Static Code Analysis (SCA)",
      "abstract": "<p>According to recent studies, developers spend about 42% of their time maintaining and reviewing code, leading to significant inefficiencies in build time and shipment. Static code analysis has sought to reduce this problem over the last 20+ years and has been evolving to allow teams to automate and standardize quality across teams at scale. This talk takes a look at how SCA has evolved and where it is likely headed in the future.</p>",
      "time": "11:15"
    },{
      "file": "elizabet.jpg",
      "name": "Elizabet Oliveira",
      "role": "Senior Product Designer @ Elastic",
      "bio": "Elizabet is a designer who codes! She started her career as a web developer, and soon she realized that she prefers the more visual side of the web. She loves interaction design, front-end technology, animation, and she’s obsessed with making the web fun again! She is passionate about open-source. In April 2018, her project React Kawaii won the \"Fun Project of the Year\" award at React Amsterdam! Music was also a big part of her life. She was the first female solo Hip-Hop artist signing to a major label (Universal Music) in Portugal. Her songs reached the top of MTV Portugal's charts, but she soon realized that she was not meant to be an artist. She found out that she is much happier designing, coding, and speaking at conferences all around the world!",
      "github": "miukimiu",
      "twitter": "miuki_miu",
      "linkedin": "elizabetoliveira",
      "title": "Building a Markdown Editor from a Designer Perspective",
      "abstract": "<p>Recently I've built a Markdown Editor for Elastic UI. An editor that is now being consumed in apps like Elastic Kibana. From gathering requirements, design research, agree on feature specs, and build it, it took many iterations and teamwork. In this talk, I'm going t show you how I build this editor from a designer who codes perspective. </p>",
      "time": "14:30"
    },
    {
      "file": "angel-rivera.jpg",
      "name": "Angel Rivera",
      "role": "Developer Advocate @ CircleCI",
      "bio": "Angel started his career as an US Air Force Space Systems Operations specialist in Cape Canaveral AF Station where he realized his passion for technology and software development. He has extensive experience in the private, public and military sectors and his technical experience includes military/space lift operations, technical writing, software development, SRE/DevOPs engineering. He also has a wealth of experience in defense and federal sectors such as contracting, information systems security and management.",
      "github": "punkdata",
      "twitter": "punkdata",
      "title": "CI/CD Agility and Controlling Pipeline Sprawl",
      "abstract": "<p>The adoption of CI/CD has automated the process of how DevOps teams build, test, and deliver software at rapid speeds and with high confidence. Although CI/CD platforms offer many benefits, in the attempt to make sophisticated pipelines, many teams run into the issue of “Pipeline Sprawl”. Pipeline sprawl makes it difficult for DevOps teams to identify and reuse common execution patterns which diminishes their ability to efficiently ship new code. <br><br> In this talk, Angel will discuss the common pain points associated with existing CI/CD platforms. The talk will pull in examples from his recent experience and conversations with DevOps teams from across the open source community, startups, and large enterprises. Attendees will learn technical strategies to develop pipeline configurations that diminish potentially costly vendor-lock in.</p>",
      "time": "15:00"
    },
    {
      "file": "rob.jpg",
      "name": "Rob Richardson",
      "role": "Developer Evangelist @ MemSQL",
      "bio": "Rob Richardson is a software craftsman building web properties in ASP.NET and Node, React and Vue. He’s a Microsoft MVP, published author, frequent speaker at conferences, user groups, and community events, and a diligent teacher and student of high quality software development. You can find this and other talks on https://robrich.org/presentations and follow him on twitter at @rob_rich.",
      "github": "robrich",
      "twitter": "rob_rich",
      "title": "Databases in the Microservices World",
      "abstract": "<p>Web technologies have come leaps and bounds. But are you still using the tired old database from last generation? Let's look at the methodology of microservices, compare it to bounded contexts, and look at ops tasks for micro-databases. Let's tour all the flavors of databases, understand their pros and cons, and when you would choose it. You'll leave with a roadmap for moving from data-monolith to micro-databases.</p>",
      "time": "15:30"
    },
    {
      "type": "filled",
      "content": [
        {
          "text": "Closing Session",
          "time": "16:00"
        }
      ]
    }
  ]
}
